Управление_по_целям_и_KPI/src/Documents/KPI_ОпределениеЦелей/KPI_ОпределениеЦелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ОпределениеЦелей</name>
  <registerRecords>InformationRegister.KPI_СоответствиеЦелейИПоказателей</registerRecords>
  <tabularSections>
    <name>СписокЦелей</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПоказателей</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СоответствиеЦелейИПоказателей/KPI_СоответствиеЦелейИПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СоответствиеЦелейИПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Цель</name>
    <type>
      <types>CatalogRef.KPI_Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_ОпределениеЦелей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр KPI_СоответствиеЦелейИПоказателей
	Движения.KPI_СоответствиеЦелейИПоказателей.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПоказателей Из СписокПоказателей Цикл
		Движение = Движения.KPI_СоответствиеЦелейИПоказателей.Добавить();
		Движение.Период = Дата;
		Движение.Цель = ТекСтрокаСписокПоказателей.Цель;
		Движение.ЦелевойПоказатель = ТекСтрокаСписокПоказателей.ЦелевойПоказатель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
